export const ukLocalResource = {
  translation: {
    "ui.translator_name": "Дмитро Рубанов",
    "ui.translator_vk_id": "id17483226",

    // Interface elements
    "ui.menu_autor": "Автор — Александр Качкаев",
    "ui.l_app_title_1": "Будівник",
    "ui.l_app_title_2": "графіків",
    "ui.l_app_version": "версія ",
    "ui.h_info": "Про це додатку",
    "ui.h_boundaries": "Область побудови",
    "ui.h_color": "Вибір кольору",

    "ui.l_info_1":
      "Будівник графіків дозволяє миттєво будувати до 10 графіків функцій одночасно.",
    "ui.l_info_2": "Якщо тобі сподобався цей додаток, запрошуй друзів!",
    "ui.l_translator": "Перекладач — ",
    "ui.l_ymax": "ymax",
    "ui.l_ymin": "ymin",
    "ui.l_xmax": "xmax",
    "ui.l_xmin": "xmin",
    "ui.l_n_of_points": "Кількість точок",
    "ui.l_y_equals": "y =",
    "ui.l_saving": "Зберігання інформації...",
    "ui.l_error_load":
      "Помилка з'єднання з сервером ВКонтакті під час отримання збережених графіків. Рекомендується спробувати оновити сторінку, щоб побачити свої графіки. Зверніть увагу, що всі зміни, які Ви зараз зробите, загубляться після закриття вікна браузера, якщо не перезавантажити сторінку.",
    "ui.l_error_save":
      "Помилка з'єднання з сервером ВКонтакті під час збереження графіків. Зміни, які Ви зараз зробите, загубляться після закриття вікна браузера. Рекомендується оновити сторінку и продовжити працювати.",
    "ui.l_autonomous_mode": "Автономний режим",

    "ui.b_plot": "Побудувати",
    "ui.b_stop": "Зупинити",
    "ui.b_del": "Видалити",
    "ui.b_help": "Довідка",
    "ui.b_group": "Група додатка",
    "ui.b_extra": "Дослідження від британських вчених!",
    "ui.b_report_an_error": "Повідомити про помилку",
    "ui.b_add_graph": "Додати ще один графік",
    "ui.b_add_app": "Додати додаток собі на сторінку",
    "ui.b_add_friends": "Запросити друзів!",
    "ui.b_apply": "Застосувати",
    "ui.b_random_color": "Випадковий колір",
    "ui.b_defaults": "За умовчанням",
    "ui.b_ok": "ОК",
    "ui.b_cancel": "Відміна",
    "ui.b_yes": "Так",
    "ui.b_no": "Ні",
    "ui.b_add": "Додати",

    "ui.c_show_grid": "Сітка",
    "ui.c_show_axes": "Координатні вісі",

    "ui.cap_f_empty":
      "Введіть фуункцію в поле вводу знизу для побудови її графіка.",
    "ui.cap_f_param_error": "Помилка в властивостях області побудови",
    "ui.cap_f_error": "Помилка в функції",

    // Errors in formula

    //// Common errors
    "error.formula.0": "Невідома помилка.",
    "error.formula.1": "Формула відсутня.",
    "error.formula.2": "Формула занадто велика.",
    "error.formula.3": "Зустрівся заборонений символ <0>{2}</0>.",

    //// Equals sign
    "error.formula.10": "Формула має містити знак рівності.",
    "error.formula.11": "Формула не може містити більше одного знака рівності.",
    "error.formula.12":
      "Знак рівності не може знаходитися у самому початку формули.",
    "error.formula.13":
      "Знак рівності не може знаходитися у самому кінці формули.",
    "error.formula.14":
      "Знак рівності не може знаходитися у дужках (кількість відкриваючих дужок у лівій частині формули менше, ніж кількість закриваючих на {2}). ",

    //// Brackets
    "error.formula.20":
      "Зайва закриваюча дужка. Закриваючих дужок не може бути більше, ніж відкритих дужок до цього.",
    "error.formula.21": "Відкриваючих дужок більше, ніж закриваючих (на {2}).",
    "error.formula.22":
      "Відкираюча дужка не може знаходитись відразу за закриваючою, необхідний знак арифметичної дії.",
    "error.formula.23":
      "Пусті дужки допустимі тільку після ім'я функції, що не має параметрів.",

    //// Wrong elements / element placement
    "error.formula.30": "<0>{2}</0> не підлягає розбору.",
    "error.formula.31": "Невідомий аргумент/константа <0>{2}</0>.",
    "error.formula.32": "<0>{2}</0> — невірний формат для числа.",
    "error.formula.33":
      "Кома може бути застосована тільки під час перерахування агрументів функції.",
    "error.formula.34": "Невідома функція. <0>{2}</0>.",
    "error.formula.35":
      "Аргумент <0>{2}</0> не може використовуватися як функція.",
    "error.formula.36":
      "Константа <0>{2}</0> не може використовуватися як функція.",
    "error.formula.37": "Після ім'я функції <0>{2}</0> обов'язкові дужки.",
    "error.formula.38": "Не вистачає знака арифметичної дії.",
    "error.formula.39": "<0>{2}</0> — занадто велике число.",

    //// Sign misplacement
    "error.formula.40": "Недопустиме положення знака <0>{2}</0>.",
    "error.formula.41": "Знак <0>{2}</0> не може стояти у самому кінці виразу.",
    "error.formula.42":
      "Знак <0>{2}</0> не може стояти у самому початку виразу.",
    "error.formula.43":
      "Знак <0>{2}</0> не може стояти перед закриваючої дужкою.",
    "error.formula.44":
      "Знак <0>{2}</0> не може стояти відразу після відкриваючої дужки.",
    "error.formula.45": "Знак <0>{2}</0> не може стояти перед комою.",
    "error.formula.46": "Знак <0>{2}</0> не може стояти після коми.",
    "error.formula.47":
      "Знак <0>{2}</0> не може стояти після іншого знака арифметичної дії.",

    //// Arguments of a function
    "error.formula.50": "Невірна кількість аргументів для функції <0>{2}</0>.",
    "error.formula.51":
      "Занадто багато аргументів передано у функцію <0>{2}</0>. Кількість аргументів має бути від {3} до {4}.",
    "error.formula.52":
      "Занадто багато аргументів передано у функцію <0>{2}</0>. Кількість аргументів має бути рівною {3}.",
    "error.formula.53": "Функція <0>{2}</0> не може містити аргументи.",
    "error.formula.54":
      "Недостатньо аргументів передано у функцію <0>{2}</0>. Кількість аргументів має бути більше {3}.",
    "error.formula.55":
      "Недостатньо аргументів передано у функцію <0>{2}</0>. Кількість аргументів має бути від {3} до {4}.",
    "error.formula.56":
      "Недостатньо аргументів передано у функцію <0>{2}</0>. Кількість аргументів має бути рівною {3}.",
    "error.formula.57":
      "Між дужкою и комою очікувався аргумент функції <0>{2}</0>.",
    "error.formula.58": "Після коми очікувався аргумент функції <0>{2}</0>.",

    //// Different errors for functions
    "error.wrong_bound":
      "Поле <0>{0}</0> має містити число у діапазані від —{1} до {1}.",
    "error.wrong_number_of_dots":
      "Поле з кількістю точок побудови має містити ціле число у діапазоні від {0} до {1}.",
    "error.small_range":
      "<0>{1}</0> має бути більше <0>{0}</0>, різниця має бути не меншою, ніж{2}.",
    "error.y_in_f":
      "<0>Y</0> не може бути в якості параметра функції. Допустимо використання тільки <0>x</0>.",
    "error.x_rus":
      " Підказка: щоб обозначити ікс, варто використовувати латинську <0>x</0>.",
    "error.vertical_slash":
      " Підказка: для побудови модуля варто використовувати функцію <0>abs</0>, наприклад, abs(x).",
    "error.comma":
      " Підказка: для відокремлення цілої і дробової частин у числах варто використовувати крапку, наприклад, 3.14.",
    "error.log_ln":
      " Подсказка: В цій версії натуральний логарифм обозначається як <0>ln</0>.",
    "error.equal_presents":
      "Другий знак <0>=</0> не може бути присутнім в виразі, ща задає функцію.",
    "error.func_name_hint":
      " Підказка: Щоб побудувати {0}, варто використовувати функцію <0>{1}</0>.",
  },
};
